Tekla Open API Reference for Tekla Structures 2025
ReinforcementMesh.ReinforcementCustomPositionCrossing Property
 Defines the location of the crossing bar when using MeshReinforcementVisibilityCrossing == ReinforcementVisibilityTypes.Customized. This location is a value between 0.0 and 1.0 and it defines the proportion from the mesh's start point.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double ReinforcementCustomPositionCrossing { get; set; }
Public Property ReinforcementCustomPositionCrossing As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ReinforcementMesh Class
Tekla.Structures.Drawing Namespace